package Lesson2;
/*
 Написать программу,
 которая печатает на консоль прямоугольник из символа "@" длины NxM
  (задается вручную, т.е. int n = 10; int m = 5, например)
 */
public class HomeWork2Task5 {
    public static void main(String[] args) {
        for (int a = 0; a < 4; a++) {
            System.out.println("@@@@@");
        }
        System.out.println();
    }
}

